Revit 2027 API
VoltageTypeSet.Contains Method
Tests for the existence of a voltage type within the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	VoltageType item
)
Public Overridable Function Contains (
	item As VoltageType
) As Boolean
public:
virtual bool Contains(
	VoltageType^ item
)
abstract Contains :
        item : VoltageType -> bool
override Contains :
        item : VoltageType -> bool
Parameters
item VoltageType
The voltage type to be searched for.
Return Value
Boolean
The Contains method returns True if the voltage type is within the set, otherwise False.
See Also
Reference
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace